Test_Rails/app/controllers/comments_controller.rb

INSERT INTO `comments` (`updated_at`, `post_id`, `comment`, `created_at`) VALUES('2009-05-02 16:04:39', 5, 'asadas', '2009-05-02 16:04:39')
---
  def create
    # Create a comment object that has
    # been instantiated with attributes
    # and linked to the post object
    @comment = @post.comments.build(params[:comment])
    if @comment.save