Test_Rails/app/controllers/posts_controller.rb

SELECT * FROM `posts`
---
  def index
    @posts = Post.all

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
---
  def show
    @post = Post.find(params[:id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 5)
---
  def edit
    @post = Post.find(params[:id])

INSERT INTO `posts` (`updated_at`, `title`, `body`, `created_at`) VALUES('2009-04-24 16:06:13', 'Hwelllloo', 'I love HLC ', '2009-04-24 16:06:13')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 953125641)
UPDATE `posts` SET `title` = 'Nene', `body` = 'Are rare birds.', `updated_at` = '2009-04-25 02:01:50' WHERE `id` = 953125641
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
DELETE FROM `posts` WHERE `id` = 1
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy